app/controllers/movies_controller.rb

SELECT * FROM "gee"."movies"
---
  def index
    @movies = Movie.all

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
---
  def show
    @movie = Movie.find(params[:id])

INSERT INTO "movies" ("created_at", "title", "updated_at") VALUES('2009-12-28 11:18:36.949343', E'Avatar', '2009-12-28 11:18:36.949343') RETURNING "id"
---
  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save